app/Controllers/MasyarakatController.php

    public function index()
    {
        $model = new MasyarakatModel();
        $data['masyarakat'] = $model->findAll();
---
SELECT *
FROM `masyarakat`