app/Controllers/PengaduanController.php

    public function index()
    {
        $data['pengaduan'] = $this->pengaduanModel->findAll();
---
SELECT *
FROM `pengaduan`

    public function store()
    {
        $data = [
            'tgl_pengaduan' => $this->request->getPost('tgl_pengaduan'),
            'nik' => $this->request->getPost('nik'),
            'isi_laporan' => $this->request->getPost('isi_laporan'),
            'foto' => $this->request->getFile('foto'),
            'status' => $this->request->getPost('status')
        ];
        $this->pengaduanModel->insert($data);
---
INSERT INTO `pengaduan` (`tgl_pengaduan`, `nik`, `isi_laporan`, `foto`, `status`) VALUES ('2023-03-08', '2179836317', 'jafdashfid', 'C:\\xamppp\\tmp\\phpD824.tmp', 'diproses')